src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeBody_full.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<nod:sendPaymentOutcomeReq>
			<idPSP>$idPSP</idPSP>
			<idBrokerPSP>$idBrokerPSP</idBrokerPSP>
			<idChannel>$idChannel</idChannel>
			<password>$password</password>
			<paymentToken>$paymentToken</paymentToken>
			<outcome>$outcome</outcome>
			<!--Optional:-->
			<details>
				<paymentMethod>creditCard</paymentMethod>
				<!--Optional:-->
				<paymentChannel>app</paymentChannel>
				<fee>2.00</fee>
				<!--Optional:-->
				<payer>
					<uniqueIdentifier>
						<entityUniqueIdentifierType>G</entityUniqueIdentifierType>
						<entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
					</uniqueIdentifier>
					<fullName>name</fullName>
					<!--Optional:-->
					<streetName>street</streetName>
					<!--Optional:-->
					<civicNumber>civic</civicNumber>
					<!--Optional:-->
					<postalCode>postal</postalCode>
					<!--Optional:-->
					<city>city</city>
					<!--Optional:-->
					<stateProvinceRegion>state</stateProvinceRegion>
					<!--Optional:-->
					<country>IT</country>
					<!--Optional:-->
					<e-mail>prova@test.it</e-mail>
				</payer>
				<applicationDate>2021-12-12</applicationDate>
				<transferDate>2021-12-11</transferDate>
			</details>
		</nod:sendPaymentOutcomeReq>
	</soapenv:Body>
</soapenv:Envelope>