src/integ-test/bdd-test/features/flows/TestFlusso_closePaymentV2_ko_closePaymentV2_ko

Feature:  flow checks for closePayment-v2 request - closePayment-v2 KO, closePayment-v2 KO [FLUSSO_CP_12]
 
  Background:
    Given systems up 
    And EC new version
    
   # verifyPaymentNotice phase
    Scenario: Execute verifyPaymentNotice request
    Given initial XML verifyPaymentNotice soap-request
    
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:verifyPaymentNoticeReq>
             <idPSP>AGID_01</idPSP>
             <idBrokerPSP>97735020584</idBrokerPSP>
             <idChannel>97735020584_03</idChannel>
             <password>pwdpwdpwd</password>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
          </nod:verifyPaymentNoticeReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
    
    When psp sends SOAP verifyPaymentNotice to nodo-dei-pagamenti
    Then check outcome is OK of verifyPaymentNotice response
    
   # activateIOPaymentReq phase
    Scenario: Execute activateIOPayment request
    Given initial XML activateIOPayment soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForIO.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activateIOPaymentReq>
             <idPSP>AGID_01</idPSP>
             <idBrokerPSP>97735020584</idBrokerPSP>
             <idChannel>97735020584_03</idChannel>
             <password>pwdpwdpwd</password>
             <!--Optional:-->
             <idempotencyKey>#idempotency_key#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
             <!--Optional:-->
             <expirationTime>60000</expirationTime>
             <amount>10.00</amount>
             <!--Optional:-->
             <dueDate>2021-12-12</dueDate>
             <!--Optional:-->
             <paymentNote>responseFull</paymentNote>
             <!--Optional:-->
             <payer>
                <uniqueIdentifier>
                   <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                   <entityUniqueIdentifierValue>77777777777</entityUniqueIdentifierValue>
                </uniqueIdentifier>
                <fullName>IOname_#idempotency_key#</fullName>
                <!--Optional:-->
                <streetName>IOstreet</streetName>
                <!--Optional:-->
                <civicNumber>IOcivic</civicNumber>
                <!--Optional:-->
                <postalCode>IOcode</postalCode>
                <!--Optional:-->
                <city>IOcity</city>
                <!--Optional:-->
                <stateProvinceRegion>IOstate</stateProvinceRegion>
                <!--Optional:-->
                <country>IT</country>
                <!--Optional:-->
                <e-mail>IO.test.prova@gmail.com</e-mail>
             </payer>
          </nod:activateIOPaymentReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activateIOPayment to nodo-dei-pagamenti
    Then check outcome is OK of activateIOPayment response
    
    # DB check_00
    # SELECT * FROM NODO_ONLINE.POSITION_ACTIVATE s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # check POSITION_ACTIVATE.PAYMENT_TOKEN == $activateIOPaymentResponse.paymentToken and
    #       POSITION_ACTIVATE.PSP_ID == $activateIOPaymentRequest.idPSP
          
    # nodoChiediInformazioniPagamento phase
    Scenario: Execute a nodoChiediInformazioniPagamento request
    Given initial json nodoChiediInformazioniPagamento
    """
        {"idPagamento": "$activateIOPaymentResponse.paymentToken"}
    """
    When PM sends nodoChiediInformazioniPagamento to nodo-dei-pagamenti
    Then check errorCode is 200
    
    # closePayment-v2 request phase  
    Scenario: Execute a closePayment-v2 request
    Given initial json closePayment-v2
    """
        {"paymentTokens": [
            "$activateIOPaymentResponse.paymentToken"
            ],
            "outcome": "KO",
            "identificativoPsp": "70000000001",
            "tipoVersamento": "TPAY",
            "identificativoIntermediario": "70000000001",
            "identificativoCanale": "70000000001_03",
            "transactionId": "13789546",
            "totalAmount": 12.00,
            "fee": 2.00,
            "timestampOperation": "2033-04-23T18:25:43Z",
            "additionalPaymentInformations": {
                  "key": "17782342"
                }
            }
    """

    When PM sends closePayment-v2 to nodo-dei-pagamenti
    Then check esito is OK 
    And check errorCode is 200
    
    # closePayment-v2 request phase 1  
    Scenario: Execute a closePayment-v2 request twice
    Given initial json closePayment-v2
    """
        {"paymentTokens": [
            "$activateIOPaymentResponse.paymentToken"
            ],
            "outcome": "KO",
            "identificativoPsp": "70000000001",
            "tipoVersamento": "TPAY",
            "identificativoIntermediario": "70000000001",
            "identificativoCanale": "70000000001_03",
            "transactionId": "13789546",
            "totalAmount": 12.00,
            "fee": 2.00,
            "timestampOperation": "2033-04-23T18:25:43Z",
            "additionalPaymentInformations": {
                  "key": "17782342"
                }
            }
    """

    When PM sends closePayment-v2 to nodo-dei-pagamenti
    Then check esito is KO 
    And check descrizione is 'Esito non accettabile a token scaduto'
    And check errorCode is 400
 
    # DB check_01
    # SELECT s.* FROM NODO_ONLINE.POSITION_PAYMENT_STATUS s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#' order by s.ID asc;
    # SELECT s.* FROM NODO_ONLINE.POSITION_PAYMENT_STATUS_SNAPSHOT s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # SELECT s.* FROM NODO_ONLINE.POSITION_STATUS s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # SELECT s.* FROM NODO_ONLINE.POSITION_STATUS_SNAPSHOT s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # SELECT s.* FROM NODO_ONLINE.POSITION_PAYMENT s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # SELECT s.* FROM NODO_ONLINE.POSITION_SERVICE s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # SELECT s.* FROM NODO_ONLINE.PM_SESSION_DATA s where s.ID_SESSIONE = '$activateIOPaymentResponse.paymentToken';
    # SELECT s.* FROM NODO_ONLINE.POSITION_SUBJECT s where s.FULL_NAME = 'IOname_#idempotency_key#';
    # SELECT s.* FROM NODO_ONLINE.POSITION_ACTIVATE s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # SELECT s.* FROM NODO_ONLINE.PM_METADATA s where s.TRANSACTION_ID = '$closePayment-v2.transactionId' order by s.id asc;
        
    # check
    
    #POSITION_PAYMENT_STATUS
    # ID != null
    # PA_FISCAL_CODE == '#creditor_institution_code#'
    # NOTICE_ID == '#notice_number#'
    # STATUS == 'PAYING'
    # INSERTED_TIMESTAMP != null
    # CREDITOR_REFERENCE_ID == iuv
    # PAYMENT_TOKEN == $activateIOPaymentResponse.paymentToken

    # STATUS1 == 'CANCELLED'
    # STATUS2 == null
    
    #POSITION_PAYMENT_STATUS_SNAPSHOT
    # ID != null
    # PA_FISCAL_CODE == '#creditor_institution_code#'
    # NOTICE_ID == '#notice_number#'
    # CREDITOR_REFERENCE_ID == iuv
    # PAYMENT_TOKEN == $activateIOPaymentResponse.paymentToken
    # STATUS == 'CANCELLED'
    # INSERTED_TIMESTAMP != null
    # UPDATED_TIMESTAMP != null
    # FK_POSITION_PAYMENT == POSITION_PAYMENT.id

    # ID1 == null
    
    #POSITION_STATUS
    # ID != null
    # PA_FISCAL_CODE == '#creditor_institution_code#'
    # NOTICE_ID == '#notice_number#'
    # STATUS == 'PAYING'
    # INSERTED_TIMESTAMP != null

    # STATUS1 == 'INSERTED'
    
    #POSITION_STATUS_SNAPSHOT
    # ID != null
    # PA_FISCAL_CODE == '#creditor_institution_code#'
    # NOTICE_ID == '#notice_number#'
    # STATUS == 'INSERTED'
    # INSERTED_TIMESTAMP != null
    # UPDATED_TIMESTAPM != null
    # FK_POSITION_SERVICE == POSITION_SERVICE.id

    # id1 == null
    
    #POSITION_PAYMENT
    # ID5 != null
    # PA_FISCAL_CODE5 == '#creditor_institution_code#'
    # NOTICE_ID5 == '#notice_number#'
    # CREDITOR_REFERENCE_ID5 == iuv
    # PAYMENT_TOKEN5 == $activateIOPaymentResponse.paymentToken
    # BROKER_PA_ID5 == '#creditor_institution_code#'
    # STATION_ID5 == '#stazione#'
    # STATION_VERSION5 == 2
    # PSP_ID5 == $activateIOPaymentRequest.idPSP
    # BROKER_PSP_ID5 == $activateIOPaymentRequest.idBrokerPSP
    # CHANNEL_ID5 == $activateIOPaymentRequest.idChannel
    # IDEMPOTENCY_KEY5 == '#idempotency_key#'
    # AMOUNT5 == 10
    # FEE5 == null
    # OUTCOME5 == null
    # PAYMENT_METHOD5 == null
    # PAYMENT_CHANNEL5 == 'WISP'
    # TRANSFER_DATE5 == null
    # PAYER_ID5 == POSITION_SUBJECT.ID
    # APPLICATION_DATE5 == null
    # INSERTED_TIMESTAMP5 != null
    # UPDATED_TIMESTAMP5 != null
    # FK_PAYMENT_PLAN5 != null
    # RPT_ID5 == null
    # PAYMENT_TYPE5 == 'MOD3'
    # CARRELLO_ID5 == null
    # ORIGINAL_PAYMENT_TOKEN5 == null
    # FLAG_IO5 == 'Y'
    # RICEVUTA_PM5 == 'Y'
    # FLAG_PAYPAL == 'N'
    # TRANSACTION_ID_pp == null
     
    #PM_METADATA
    # ID == null
     
    # POSITION_ACTIVATE
    # payTok == $activateIOPaymentResponse.paymentToken
    # psp12 == $activateIOPaymentRequest.idPSP
     